{"pairedWines": ["merlot", "cabernet sauvignon", "pinot noir"], "pairingText": "Merlot, Cabernet Sauvignon, and Pinot Noir are my top picks for Steak. After all, beef and red wine are a classic combination. Generally, leaner steaks go well with light or medium-bodied reds, such as pinot noir or merlot, while fattier steaks can handle a bold red, such as cabernet sauvingnon. One wine you could try is Black River Winery Merlot. It has 4.3 out of 5 stars and a bottle costs about 10 dollars.", "productMatches": [{"id": 430352, "title": "Black River Winery Merlot", "description": null, "price": "$10.0", "imageUrl": "https://spoonacular.com/productImages/430352-312x231.jpg", "averageRating": 0.86, "ratingCount": 2.0, "score": 0.7171428571428571, "link": "https://www.amazon.com/2009-Black-River-Winery-Merlot/dp/B00ED59310?tag=spoonacular-20"}]}{"pairedWines": ["malbec", "merlot", "zinfandel"], "pairingText": "Malbec, Merlot, and Zinfandel are great choices for Burger. Merlot will be perfectly adequate for a classic burger with standard toppings. Bolder toppings call for bolder wines, such as a malbec or peppery zinfandel. One wine you could try is Belasco de Baquedano Swinto Malbec. It has 4.2 out of 5 stars and a bottle costs about 23 dollars.", "productMatches": [{"id": 448016, "title": "Belasco de Baquedano Swinto Malbec", "description": "Swinto shows an attractive deep purple color. Complex and powerful in the nose, this exuberant wine boasts an intense aromatic range of ripe black fruits and jams perfectly assembled sith spicy notes provided by the oak ageing. Flavorful, dense and generous, Swinto deliveres an outstanding balance between structure and fruitiness that adds character, power, elegance and a great length to this terrific wine.", "price": "$22.99", "imageUrl": "https://spoonacular.com/productImages/448016-312x231.jpg", "averageRating": 0.8400000000000001, "ratingCount": 5.0, "score": 0.7775000000000001, "link": "https://click.linksynergy.com/deeplink?id=*QCiIS6t4gA&mid=2025&murl=https%3A%2F%2Fwww.wine.com%2Fproduct%2Fbelasco-de-baquedano-swinto-malbec-2008%2F108093"}]}